{
  "title": "Наталия Швиндт",
  "subtitle": "Фулстек-разработчик",
  "description": "Я превращаю идеи в эффективные и значимые цифровые продукты.",

  "nav": {
    "home": "Главная",
    "presentation": "Обо мне",
    "skills": "Навыки",
    "projects": "Проекты",
    "contact": "Контакты"
  },

  "app": {
    "scroll": {
      "assist": {
        "enable": "Включить полосу прокрутки",
        "disable": "Выключить полосу прокрутки"
      }
    }
  },

  "presentation": {
    "heading": "Искусство создавать.",
    "p1": "Моё увлечение технологиями началось несколько лет назад, когда я открыла для себя возможность воплощать абстрактные идеи с помощью кода.",
    "p2": "Я посвящаю свою силу созданию решений, которые не только работают, но и вдохновляют.",
    "p3": "Каждая строка кода, каждый проект — это возможность раскрыть новую грань инноваций.",
    "p4": "Я стремлюсь к эффективности и элегантности, всегда желая превращать видения в реальность."
  },
  "skills": {
    "frontend": "Фронтенд",
    "backend": "Бэкенд"
  },

  "skillsTools": {
    "tools": "Инструменты",
    "softSkills": "Мягкие навыки",
    "soft": {
      "communication": "Коммуникация",
      "teamwork": "Командная работа",
      "problemSolving": "Решение проблем",
      "criticalThinking": "Критическое мышление",
      "adaptability": "Адаптивность",
      "timeManagement": "Управление временем",
      "creativity": "Креативность",
      "empathy": "Эмпатия",
      "leadership": "Лидерство"
    }
  },
  "projects": {
    "ahorradas": {
      "title": "АхоррадАС",
      "description": "Веб-приложение, разработанное в команде с другой студенткой в рамках совместной практики, ориентированное на управление личными финансами. Позволяет записывать доходы и расходы, применять фильтры по типу, категории или дате и просматривать персонализированные отчёты. Проект создан с использованием Vanilla JavaScript, Tailwind CSS и LocalStorage. Включает полностью переведённую на русский версию для расширения аудитории.",
      "image": "AhorrADAs.png",
      "github": "https://github.com/Natalia-Schwindt/proyectoAhorrADAs"
    },
    "buscadorDeComics": {
      "title": "Поиск комиксов",
      "description": "Веб-приложение, которое позволяет искать, фильтровать и сортировать комиксы и персонажей Marvel с использованием их официального API. Имеется постраничный вывод и отображение результатов в адаптивных карточках с изображениями и основными деталями. Разработано с использованием HTML, Tailwind CSS и чистого JavaScript.",
      "image": "BuscadorDeComics.png",
      "github": "https://github.com/Natalia-Schwindt/buscadorDeComics"
    },
    "editorDeMemes": {
      "title": "Редактор мемов",
      "description": "Индивидуально разработанный редактор мемов с использованием HTML, CSS и Vanilla JavaScript. Позволяет кастомизировать изображения, добавляя верхний и нижний текст с большим количеством параметров: шрифт, размер, выравнивание, цвет, контур, интервал межсимвольный и межстрочный интервалы. Также включает инструменты для изменения внешнего вида изображения с помощью фильтров (яркость, контраст, прозрачность, размытие) и возможность скачать готовый мем в формате изображения. Проект сосредоточен на работе с DOM, динамическими стилями и удобстве визуального редактирования.",
      "image": "EditorDeMemes.png",
      "github": "https://github.com/Natalia-Schwindt/editordememes"
    },
    "proyectoFinalReact": {
      "title": "Ecommerce проект на React",
      "description": "Приложение электронной коммерции, разработанное с использованием React, имитирующее процесс покупки товаров. Позволяет просматривать базу данных товаров, применять фильтры по цене, искать по названию, отмечать избранные товары и управлять интерактивной корзиной. Приложение имитирует завершение покупки с помощью визуального подтверждения. Использует Firebase как имитируемый бэкенд и разработано с Chakra UI для доступного и адаптивного интерфейса. Включает динамическую навигацию с React Router, оптимизированные формы с react-hook-form и плавные анимации с framer-motion.",
      "image": "proyectoFinalReact.png",
      "github": "https://github.com/Natalia-Schwindt/proyectoFinalReact"
    },
    "proyectoQR": {
      "title": "Проект QR",
      "description": "Проект веб-дизайна, имитирующий цифровое меню ресторана. Разработан с использованием чистого HTML и CSS. Изображения созданы с помощью искусственного интеллекта (Leonardo AI), что обеспечило оригинальный и согласованный визуальный стиль. Сайт имеет разделы напитков, блюд и десертов с креативными описаниями, которые усиливают уникальность ресторана. Опыт дополнен QR-кодом для лёгкого доступа к меню с мобильных устройств, имитируя реальное использование. Этот проект был одним из самых увлекательных благодаря сочетанию дизайна, повествования и визуального творчества.",
      "image": "ProyectoQR.png",
      "github": "https://github.com/Natalia-Schwindt/proyectoqr"
    },
    "toDoList": {
      "title": "Список задач",
      "description": "Приложение, разработанное как финальный проект Модуля V в ADA ITW. Позволяет создавать и управлять списками задач динамически, интуитивно и полностью адаптивно. Пользователь может добавлять задачи, редактировать их, фильтровать по статусу (в ожидании или выполненные) и удалять при необходимости. Дизайн реализован с использованием React и Chakra UI для плавного опыта использования на любом устройстве. Практичный инструмент для улучшения личной или рабочей организации. Проект использует Vite для быстрого и эффективного окружения разработки.",
      "image": "ToDoList.png",
      "github": "https://github.com/Natalia-Schwindt/todolist"
    }
  },

  "footer": {
    "alert": {
      "configError": "Ошибка настройки: свяжитесь с администратором сайта.",
      "configErrorConsole": "Ошибка: переменные среды EmailJS не настроены правильно.",
      "success": "Сообщение успешно отправлено. Спасибо за обращение!",
      "failed": "Произошла ошибка при отправке сообщения. Пожалуйста, попробуйте позже."
    },
    "title": "Связаться со мной",
    "subtitle": "Буду рад(а) получить от вас сообщение! Вы можете связаться со мной через соцсети или используя форму ниже.",
    "form": {
      "name": "Ваше имя",
      "email": "Ваш email",
      "message": "Текст сообщения",
      "submit": "Отправить"
    },
    "copyright": "Создано Наталией Швиндт © {{year}}. Все права защищены."
  }
}
